tap "dart-lang/dart"
tap "dbcli/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "universal-ctags/universal-ctags"
brew "xz"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "bat"
brew "black"
brew "cmake"
brew "cocoapods"
brew "commitizen"
brew "direnv"
brew "duf"
brew "fd"
brew "flac"
brew "gnutls"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "libavif"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "gnupg"
brew "gnupg@1.4"
brew "netpbm"
brew "graphviz"
brew "htop"
brew "httpie"
brew "hugo"
brew "lazygit"
brew "neovim"
brew "nginx", restart_service: true
brew "node"
brew "openjdk"
brew "openjdk@17"
brew "pgcli"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14", restart_service: true
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "qt@5"
brew "ripgrep"
brew "rust"
brew "scc"
brew "starship"
brew "subversion"
brew "ta-lib"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "uv"
brew "wget"
brew "youtube-dl"
brew "zoxide"
brew "zsh"
brew "dart-lang/dart/dart"
cask "alacritty"
cask "font-hack-nerd-font"
cask "jetbrains-toolbox"
cask "ngrok"
cask "raycast"
cask "redis-pro"
cask "warp"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "mhutchie.git-graph"
vscode "mintlify.document"
vscode "ms-pyright.pyright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "oderwat.indent-rainbow"
vscode "ritwickdey.liveserver"
vscode "vscjava.vscode-java-debug"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wakatime.vscode-wakatime"
